modules/Event/Models/Event.php

select count(*) as aggregate from `user_wishlist` where `user_wishlist`.`object_id` = 27 and `user_wishlist`.`object_id` is not null and `object_model` = 'event'
---
    public function getNumberWishlistInService($status = false)
    {
        return $this->hasOne($this->userWishListClass, 'object_id','id')->where('object_model' , $this->type)->count();