app/User.php

select * from `user_meta` where (`user_id` = 47 and `name` = 'social_meta_avatar') limit 1
---
        public function getMeta($key, $default = '')
        {
            //if(isset($this->cachedMeta[$key])) return $this->cachedMeta[$key];

            $val = DB::table('user_meta')->where([
                'user_id' => $this->id,
                'name'    => $key
            ])->first();

select count(`id`) as aggregate from `users` where `verify_submit_status` in ('new', 'partial') and `users`.`deleted_at` is null
---
        public static function countVerifyRequest(){
            return parent::query()->whereIn('verify_submit_status',['new','partial'])->count(['id']);

select * from `bravo_user_plan` where `bravo_user_plan`.`user_id` = 369 and `bravo_user_plan`.`user_id` is not null and `status` = 1 and `end_date` > '2026-05-26 09:49:38'
---
        public function checkUserPlan(){

            if(!is_enable_plan()) return true;

            $user_plans = $this->userPlans()->where('status',1)->where('end_date','>',now())->get();