app/Helpers/AppHelper.php

select * from `core_settings` where `name` = 'site_title' limit 1
---
function setting_update_item($item,$val){

    $s = Settings::where('name',$item)->first();