modules/User/Controllers/PlanController.php

select * from `bravo_user_plan` where `bravo_user_plan`.`id` = 369 limit 1
---

        if (!$plan->price || $plan->price >= 0) {
            // For Free
            $new_user_plan = UserPlan::query()->find($user->id);