modules/Page/Models/Page.php

select `id`, `title` as `name` from `core_pages` where `core_pages`.`id` = 21 and `core_pages`.`deleted_at` is null limit 1
---
    public static function getAsMenuItem($id)
    {
        return parent::select('id', 'title as name')->find($id);